Public Attributes | List of all members
API_AnalyticalCylinderSurface Struct Reference
Analytical Model
TBD. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
 API_Coord3D  | basePoint
The base point of the cylinder surface.
 API_Vector3D  | axisDirection
The axis direction of the cylinder surface.
 API_Vector3D  | referenceRay
The reference ray of the cylinder surface.
Detailed Description
TBD.
Since
Archicad 24